app/controllers/legislators_controller.rb

SELECT * FROM "legislators"
---
  def index
    @legislators = Legislator.all

SELECT * FROM "legislators" WHERE ("legislators"."id" = 181)
---
  def show
    @legislator = Legislator.find(params[:id])

SELECT * FROM "legislators" WHERE ("legislators"."id" = 1)
---
  def edit
    @legislator = Legislator.find(params[:id])